futurehome/stm32bfg/AVR/HostInteractionProtocols.c
/*
 * OperationProtocols.c
 *
 * Created: 06/01/2013 17:25:01
 *  Author: NASSER GHOSEIRI
 * Company: Butterfly Labs
 */ 
 #include "stm32f10x.h"
#include "std_defs.h"
#include "MCU_Initialization.h"
#include "JobPipe_Module.h"
#include "Generic_Module.h"
#include "ChainProtocol_Module.h"
#include "USBProtocol_Module.h"
#include "A2D_Module.h"
#include "ASIC_Engine.h"
//#include <avr32/io.h>
#include "HostInteractionProtocols.h"
#include "AVR32X/AVR32_Module.h"
#include "AVR32_OptimizedTemplates.h"
#include "PipeProcessingKernel.h"
#include "FAN_Subsystem.h"
#include "bf_peripheral_timer.h"
#include "bf_general.h"
#include "usb_endp.h"

#include <string.h>
#include <stdio.h>

//extern   char	__inprocess_SCQ_chip_processing[TOTAL_CHIPS_INSTALLED];
//extern unsigned int    __total_jobs_in_buffer;
extern unsigned int	__total_buf_pipe_jobs_ever_received;
extern 	int XLINK_ARE_WE_MASTER;
extern unsigned char GLOBAL_INTERNAL_ASIC_RESET_EXECUTED;
extern u16 __chip_existence_map[TOTAL_CHIPS_INSTALLED]; // Bit 0 to Bit 16 in each word says if the engine is OK or not...
extern char GLOBAL_CRITICAL_TEMPERATURE;
extern unsigned int GLOBAL_XLINK_DEVICE_AVAILABILITY_BITMASK;
extern int GLOBAL_BLINK_REQUEST;
extern unsigned int GLOBAL_LastJobResultProduced;
extern char  __inprocess_SCQ_midstate[TOTAL_CHIPS_INSTALLED][32];
extern char  __inprocess_SCQ_blockdata[TOTAL_CHIPS_INSTALLED][16];
extern SOFT_TIMER SoftTimer0;
extern u16 	wReceiveLoopBufferStart;
extern u8 	cUsbReceiveLoopBuffer[USB_LOOP_BUFFER_SIZE];
extern __CHIP_PROCESSING_STATUS ChipMiningStatus[TOTAL_CHIPS_INSTALLED];


// Declared somewhere else
char GLOBAL_InterProcChars[128];
unsigned int iMark1;
unsigned int iMark2;
unsigned int GLOBAL_BufResultToUSBLatency;
unsigned int GLOBAL_ResBufferCompilationLatency;
unsigned int GLOBAL_USBToHostLatency;

BF_USB_PROTOCOL_OUT_PIPE_DATA_BELONGS_Def UsbOutDataBelongs;
const unsigned char __aux_CharMap[] = {'0','1','2','3','4','5','6','7','8','9','A','B','C','D','E','F'};






PROTOCOL_RESULT Protocol_chain_forward(char iTarget, char* sz_cmd, unsigned int iCmdLen)
{
	// OK We've detected a ChainForward request. First Send 'OK' to the host
	char szRespData[2048];
	unsigned int iRespLen = 0;
	char  bDeviceNotResponded = 0;
	char  bTimeoutDetected = 0;
	unsigned int umx ;
	char iTotalAttempts;
	
	for (umx = 0; umx < 2048; umx++) szRespData[umx] = 0;
	
	  iTotalAttempts = 0; // In case of an error, we'll retry several times. The error can be 3, 5 or 50
	
	while (iTotalAttempts < 3)
	{
		// Reset Watchdog
		WATCHDOG_RESET;
		
		// Proceed
		XLINK_MASTER_transact(iTarget,
						  sz_cmd,
						  iCmdLen,
						  szRespData,
						  &iRespLen,
						  2048,					// Maximum response length
						  __XLINK_TRANSACTION_TIMEOUT__,
						  &bDeviceNotResponded,
						  &bTimeoutDetected,
						  TRUE);
	
		// Check response errors
		if (bDeviceNotResponded)
		{
			USB_send_string("ERR:NO RESPONSE");
			return PROTOCOL_FAILED;
		}
	
		if (bTimeoutDetected)
		{
			if ((iTotalAttempts < 3) && ((bTimeoutDetected == 3) || (bTimeoutDetected == 5) || (bTimeoutDetected == 50)))
			{
				// Just retry
				iTotalAttempts++;
				continue;
			}
			else
			{
				sprintf(szRespData,"ERR:TIMEOUT %d\n", bTimeoutDetected);
				USB_send_string(szRespData);
				return PROTOCOL_FAILED;				
			}
		}		
		
		// Ok break, since we're all ok
		break;
	}
		
	// Send the response back to our host
	USB_write_data ((u8*)szRespData, iRespLen);
	
	// We've been successful
	return PROTOCOL_SUCCESS;
}

PROTOCOL_RESULT Protocol_id(void)
{
	// Our result
	PROTOCOL_RESULT res = PROTOCOL_SUCCESS;

	// All is good... sent the identifier and get out of here...
	if (XLINK_ARE_WE_MASTER)
		USB_send_string(UNIT_ID_STRING);  // Send it to USB
	else // We're a slave... send it by XLINK
	{
		char bTimeoutDetected = FALSE;
		XLINK_SLAVE_respond_transact(UNIT_ID_STRING,
									 strlen(UNIT_ID_STRING),
									 __XLINK_TRANSACTION_TIMEOUT__,
									 &bTimeoutDetected,
									 FALSE);
	}
	// Return our result...
	return res;
}

PROTOCOL_RESULT Protocol_info_request(void)
{
	// Our result
	PROTOCOL_RESULT res = PROTOCOL_SUCCESS;
	
	// What is our information request?
	//char szInfoReq[16384];
	char szInfoReq[4096];		//shrink to 4K due to ARM only have 20KB sram
	char szTemp[256];
	//u32 uL1   = 0;    
	//  u32 uL2   = 0;
	 // u32 vL1	= 0;
	 // u32 vL2	= 0;    
	//  u32 xL1	= 0;
	//  u32 xL2	= 0;
	//  u32 uLRes = 0; 
	unsigned int iTheoreticalMaxSpeed;
	char umx;
	char iGoodEnginesIndex;
	char umz;
	int iDetectedFreq;

   
	
	// Atomic Full-Asm Special CPLD Write latency
	//unsigned int  iLM[16];
	//unsigned char ilmCounter = 0;
	//unsigned int  iNonceCount;
	szInfoReq[0] = 0;		//set zero length string
	strcpy(szInfoReq,"DEVICE: BitFORCE SC\n");
	strcpy(szTemp,"");
	
	// Add Firmware Identification
	sprintf(szTemp,"FIRMWARE: %s\n", __FIRMWARE_VERSION);
	strcat(szInfoReq, szTemp);
	

	
	/*
	unsigned int iTMTX = MACRO_GetTickCountRet;
	JobPipe__test_buffer_shifter();
	unsigned int iTMTX2 = MACRO_GetTickCountRet - iTMTX;
	sprintf(szTemp,"JobPipe__test_buffer_shifter takes %d us\n", iTMTX2);
	strcat(szInfoReq,szTemp);
	
	// Display mark1, mark2 and diff
	sprintf(szTemp,"Mark1: %d, Mark2: %d, Diff: %d\n", iMark1, iMark2, (unsigned int)(iMark2 - iMark1));
	strcat(szInfoReq, szTemp);
	
	sprintf(szTemp,"DbgTraceTimers %d,%d,%d,%d,%d,%d,%d,%d\n",
			DEBUG_TraceTimers[0],
			DEBUG_TraceTimers[1],
			DEBUG_TraceTimers[2],
			DEBUG_TraceTimers[3],
			DEBUG_TraceTimers[4],
			DEBUG_TraceTimers[5],
			DEBUG_TraceTimers[6],
			DEBUG_TraceTimers[7]
			);
	strcat(szInfoReq, szTemp);
	*/
	
	#if defined(__SHOW_PIPE_TO_USB_LOG)
		sprintf(szTemp, "BUFFER to HOST Took: %d us\n", GLOBAL_BufResultToUSBLatency);
		strcat(szInfoReq, szTemp);		
		sprintf(szTemp, "-- USB to HOST latency: %d us\n", GLOBAL_USBToHostLatency);
		strcat(szInfoReq, szTemp);		
		sprintf(szTemp, "-- BUFFER compilation: %d us\n", GLOBAL_ResBufferCompilationLatency);
		strcat(szInfoReq, szTemp);
	#endif
		
	// Did we internally reset the ASICS?
	sprintf(szTemp,"IAR Executed: %s\n", (GLOBAL_INTERNAL_ASIC_RESET_EXECUTED == TRUE) ? "YES" : "NO");
	strcat(szInfoReq, szTemp);
	
