futurehome/stm32bfg/AVR/HostInteractionProtocols.c
	// Chip parallelization?
	#if defined(QUEUE_OPERATE_ONE_JOB_PER_CHIP)
		sprintf(szTemp,"CHIP PARALLELIZATION: YES @ %d\n", ASIC_get_chip_count());
		strcat(szInfoReq, szTemp);
	#else
		sprintf(szTemp,"CHIP PARALLELIZATION: NO\n");
		strcat(szInfoReq, szTemp);
	#endif
	
	// Also mark the Queue depth
	sprintf(szTemp,"QUEUE DEPTH:%d\n", PIPE_MAX_BUFFER_DEPTH);
	strcat(szInfoReq, szTemp);
	
	// TODO: Remove after debugging done
	/*
	sprintf(szTemp,"LAST XLINK TRANS. LATENCY: %d us\n", DEBUG_LastXLINKTransTook);
	strcat(szInfoReq, szTemp);
	*/
	
	// Scattered operation took?
	// Issue jobs to the queue
	/*
	static int iMMA = 0;
	
	if (iMMA == 1)
	{
		  unsigned int iHighTestTime = 0;
		
		JobPipe__pipe_set_buf_job_results_count(0);
		job_packet jpx;
		JobPipe__pipe_push_job(&jpx); JobPipe__pipe_push_job(&jpx);
		JobPipe__pipe_push_job(&jpx); JobPipe__pipe_push_job(&jpx);
		JobPipe__pipe_push_job(&jpx); JobPipe__pipe_push_job(&jpx);
		JobPipe__pipe_push_job(&jpx); JobPipe__pipe_push_job(&jpx);
		JobPipe__pipe_push_job(&jpx); JobPipe__pipe_push_job(&jpx);
		JobPipe__pipe_push_job(&jpx); JobPipe__pipe_push_job(&jpx);
		JobPipe__pipe_push_job(&jpx); JobPipe__pipe_push_job(&jpx);
		JobPipe__pipe_push_job(&jpx); JobPipe__pipe_push_job(&jpx);
		JobPipe__pipe_push_job(&jpx); JobPipe__pipe_push_job(&jpx);
		JobPipe__pipe_push_job(&jpx); JobPipe__pipe_push_job(&jpx);
		JobPipe__pipe_push_job(&jpx); JobPipe__pipe_push_job(&jpx);
		JobPipe__pipe_push_job(&jpx); JobPipe__pipe_push_job(&jpx);
		JobPipe__pipe_push_job(&jpx); JobPipe__pipe_push_job(&jpx);
		JobPipe__pipe_push_job(&jpx); JobPipe__pipe_push_job(&jpx);
		JobPipe__pipe_push_job(&jpx); JobPipe__pipe_push_job(&jpx);
		JobPipe__pipe_push_job(&jpx); JobPipe__pipe_push_job(&jpx);		
		
		while (JobPipe__pipe_get_buf_job_results_count() != 32)
		{
			WATCHDOG_RESET;
			Microkernel_Spin();
			if (JobPipe__pipe_get_buf_job_results_count() == 16)
			{
				if (iHighTestTime == 0) iHighTestTime = MACRO_GetTickCountRet;
			}
			//PipeKernel_Spin();
		}
		
		JobPipe__pipe_set_buf_job_results_count(0);
		
		iHighTestTime = MACRO_GetTickCountRet - iHighTestTime;
		sprintf(szTemp,"HIGH-TEST Took: %d ms\n", (iHighTestTime/1000));
		strcat(szInfoReq, szTemp);				
	}
	
	iMMA = 1;
	*/
	
	
	// Perform chip-by-chip test
	#if defined(__PERFORM_CHIP_BY_CHIP_TEST)
		
		for (char iScanChip = 0; iScanChip < TOTAL_CHIPS_INSTALLED; iScanChip++)
		{
			if (!CHIP_EXISTS(iScanChip)) continue;
			
			const job_packet Jb7 = {{0x33,0xFB,0x46,0xDC,0x61,0x2A,0x7A,0x23,0xF0,0xA2,0x2D,0x63,0x31,0x54,0x21,0xDC,0xAE,0x86,0xFE,0xC3,0x88,0xC1,0x9C,0x8C,0x20,0x18,0x10,0x68,0xFC,0x95,0x3F,0xF7},
									{0xEF,0xAF,0xBA,0xC3,0x51,0xA3,0x6F,0x32,0x1A,0x01,0x61,0x64},0xAA};
			const unsigned int Jb7NonceCount = 8;
			const unsigned int Jb7Nonces[] = {0x045ABCED,0x50460F87,0x6C4054E0,0x7C04C5EA,0x82D56423,0xA1C4B2A0,0xECF081A3,0xF803DF88};
				
			// OK, Send a job to this chip (8 Nonce one)
			if (iScanChip < 16)
			{
				ASIC_job_issue(&Jb7, 0x0,0xFFFFFFFF, TRUE, iScanChip, FALSE);
			}	

			/*
			else
			{
				__MCU_ASIC_Activate_CS(2);
				for (unsigned char tt = 0; tt < 16; tt++)
				{
					if (!IS_PROCESSOR_OK(iScanChip, tt)) continue;
					__AVR32_SC_WriteData(iScanChip, tt, ASIC_SPI_MAP_COUNTER_LOW_LWORD, 0x0000);
					__AVR32_SC_WriteData(iScanChip, tt, ASIC_SPI_MAP_COUNTER_LOW_HWORD, 0x0000);										
					__AVR32_SC_WriteData(iScanChip, tt, ASIC_SPI_MAP_COUNTER_HIGH_LWORD, 0x0000);
					__AVR32_SC_WriteData(iScanChip, tt, ASIC_SPI_MAP_COUNTER_HIGH_HWORD, 0x1000);
					ASIC_WriteComplete(iScanChip,tt);
				}			
				__MCU_ASIC_Deactivate_CS(2);	
			}*/				
			
			// Wait until it finishes
			unsigned int iNonceList[8];
			unsigned int iNonceCount = 0;
			  unsigned int ivTimeHolder = MACRO_GetTickCountRet;
			unsigned char bTimeoutDetected = FALSE;
			
			while (TRUE)
			{
				// Have we surpassed 4 seconds? 
				if (MACRO_GetTickCountRet + 1 - ivTimeHolder > 4000000) // 4 seconds
				{
					bTimeoutDetected = TRUE;
					break;
				}
				
				// Check
				char vRes = ASIC_get_job_status(&iNonceList, &iNonceCount, TRUE, iScanChip);
				
				// Is it still processing?
				if (vRes == ASIC_JOB_NONCE_PROCESSING)
				{
					WATCHDOG_RESET;
					continue;
				} else break;			
			}	
			
			unsigned int ivTotalTime = MACRO_GetTickCountRet - ivTimeHolder;
			
			// Did we timeout?
			if (bTimeoutDetected == TRUE)
			{
				sprintf(szTemp,"PROCESSOR %X Timeout!\n", iScanChip);
				strcat(szInfoReq, szTemp);				
			}
			else
			{
				// Number of nonces found @ time
				sprintf(szTemp,"PROCESSOR %X Finished; %d Nonces @ %d ms\n", iScanChip, iNonceCount, ivTotalTime / 1000);
				strcat(szInfoReq, szTemp);				
			}
		}	
	#endif
		
	// Report all busy engines
	#if defined(__REPORT_BUSY_ENGINES)
		strcat(szInfoReq,"Engines processings:\n");
		for (char nmc = 0; nmc < TOTAL_CHIPS_INSTALLED; nmc++)
		{
			for (char nme = 0; nme < 16; nme++)
			{
				#if defined(DO_NOT_USE_ENGINE_ZERO)
					if (nme == 0) continue;
				#endif
				
				// Is this engine busy
				if (ASIC_is_engine_processing(nmc, nme))
				{
					sprintf(szTemp,"\tCHIP %d, ENGINE %d is PROCESSING\n", nmc, nme);
					strcat(szInfoReq, szTemp);
				}
			}
		}	
	#endif
	
	// Report all busy engines
	#if defined(__SHOW_DECOMMISSIONED_ENGINES_LOG)
		strcat(szInfoReq, szDecommLog);		
	#endif
	
	
	// Proceed
	#if defined(__REPORT_TEST_MINING_SPEED)
		// Our job-packet by default (Expected nonce is 8D9CB675 - Hence counter range is 8D9C670 to 8D9C67A)
		static job_packet jp;
		unsigned char index;
		char __stat_blockdata[] = {0xAC,0x84,0xF5,0x8B,0x4D,0x59,0xB7,0x4D,0x1B,0x2,0x85,0x52};
		char __stat_midstate[]  = {0x3C,0x42,0x49,0xA8,0xE1,0xC5,0x45,0x78,0xA5,0x2D,0x83,0xC1,0x1,0xE5,0xC5,0x8E,0xF5,0x2F,0x3,0xD,0xEE,0x2E,0x9D,0x29,0xB6,0x94,0x9A,0xDF,0xA6,0x95,0x97,0xAE};
		//char __stat_blockdata[] = {0x82,0xCC,0x07,0x16,0x51,0x9E,0x8B,0x95,0x1A,0x01,0x7F,0xE9};			
		//char __stat_midstate[]  = {0xE1,0x08,0xDA,0xE6,0xB6,0x0C,0xB5,0x0E,0x55,0xE8,0xC4,0x53,0xE3,0xCA,0x39,0x15,0x8B,0x5C,0x32,0xFB,0x41,0x34,0xC2,0xA2,0xD4,0x97,0xD9,0xDE,0xD5,0x35,0x67,0x64};
		
		for (index = 0; index < 12; index++) jp.block_data[index] = __stat_blockdata[index];
		for (index = 0; index < 32; index++) jp.midstate[index]   = __stat_midstate[index];
		jp.signature  = 0xAA;
	
