futurehome/stm32bfg/AVR/HostInteractionProtocols.c
		// By default it's set to true...
		unsigned char isProcessorOK = TRUE;
		
		// Now send the job to the engine
		  unsigned int UL_TIMEZERO = MACRO_GetTickCountRet;
		
		ASIC_job_issue(&jp, 0x0, 0xFFFFFFFF, FALSE, 0, FALSE);
		
		  unsigned int UL_TIMESTART = MACRO_GetTickCountRet;
		  unsigned int UL_TOTALTIME = 0;		
	
		// Read back result. It should be DONE with FIFO zero of it being 0x8D9CB675
		while(ASIC_is_processing())
		{
			if (MACRO_GetTickCountRet - UL_TIMESTART > 2000000) break; // 2 Seconds is pretty much a timeout
			 WATCHDOG_RESET;
		}			 
		
		UL_TOTALTIME = MACRO_GetTickCountRet - UL_TIMESTART - GLOBAL_LAST_ASIC_IS_PROCESSING_LATENCY;
		
		/*unsigned int iResVals[16];
		unsigned int iResCount = 0;
		ASIC_get_job_status(iResVals, &iResCount, FALSE, 0);
		sprintf(szTemp,"--NONCES:%08X,%08X\n", iResVals[0], iResVals[1]);
		strcat(szInfoReq, szTemp);*/
		
		// Total time in microseconds is in UL_TOTALTIME
		float fTotalSpeed = ((4.2969 * 1000000) / (UL_TOTALTIME));
		float fTotalSpeedPostJob = ((4.2969 * 1000000) / (MACRO_GetTickCountRet - UL_TIMEZERO));
		sprintf(szTemp,"Raw Speed: %.2f GH/s\n", fTotalSpeed);
		strcat(szInfoReq, szTemp);		
		//sprintf(szTemp,"JOB SUBMISSION: %d us\n", UL_TIMESTART - UL_TIMEZERO);
		//strcat(szInfoReq, szTemp);		
		sprintf(szTemp,"ZDX(SX) Speed: %.2f GH/s\n", fTotalSpeedPostJob);
		strcat(szInfoReq, szTemp);		
		
		// Do we test pipe?
		#if defined(__TEST_PIPE_PERFORMANCE)
	
			JobPipe__pipe_set_buf_job_results_count(0);
			JobPipe__pipe_push_job(&jp);
			JobPipe__pipe_push_job(&jp);
			JobPipe__pipe_push_job(&jp);
			Microkernel_Spin();

			  unsigned int iActualTPP_Count = 0;		
			char	 bTimeoutDetected = FALSE;
			  unsigned int iActualTime = MACRO_GetTickCountRet;	
			
			  unsigned int iMicroKernelT1;
			  unsigned int iMicroKernelT2;
			  unsigned int iMicroKernelTMAX = 0;
			  unsigned char iPA = 0;
								
			while (JobPipe__pipe_get_buf_job_results_count() < 3)
			{
				// Do we have timeout?
				  unsigned int iVMR = MACRO_GetTickCountRet + 2;
				iVMR -= iActualTime;
				if ( iVMR >= 2000000)
				{
					bTimeoutDetected = TRUE;
					break;
				}
				
				// Proceed
				WATCHDOG_RESET;
				//iMicroKernelT1 = MACRO_GetTickCountRet;
				Microkernel_Spin();
				//iMicroKernelT2 = MACRO_GetTickCountRet - iMicroKernelT1 + 1;
				
				//if (iMicroKernelT2 > iMicroKernelTMAX) 
				//{
				//	iMicroKernelTMAX = iMicroKernelT2;
				//	iPA = JobPipe__pipe_get_buf_job_results_count();
				//}					
				
				// If job count is one then set the thing
				if (JobPipe__pipe_get_buf_job_results_count() == 2)
				{
					if (iActualTPP_Count == 0)
					{
						iActualTPP_Count = MACRO_GetTickCountRet;
					}						
				}
				else if (JobPipe__pipe_get_buf_job_results_count() == 3)
				{
					iActualTPP_Count = MACRO_GetTickCountRet - iActualTPP_Count;
					break;
				}
			}
			
			if (bTimeoutDetected == TRUE)
			{
				sprintf(szTemp,"TIMEOUT DETECTED @ %dus!\n", MACRO_GetTickCountRet - iActualTime );
				strcat(szInfoReq, szTemp);				
			}
			else
			{
				unsigned int iTotalPipeTimeItTook =  iActualTPP_Count;
				float fTotalPipeSpeed = ((4.2949 * 1000000) / (iTotalPipeTimeItTook));
				sprintf(szTemp,"PIPE Mining Speed: %.2f GH/s\n", fTotalPipeSpeed);
				strcat(szInfoReq, szTemp);				
			}

		#endif 
				
		// At this point, clear results buffer
		JobPipe__pipe_set_buf_job_results_count(0);		
	#endif
	
	#if defined(__CHIP_FREQUENCY_DETECT_AND_REPORT)
		iTheoreticalMaxSpeed = 0;
		
		for (umx = 0; umx < TOTAL_CHIPS_INSTALLED; umx++)
		{		
			// Reset watchdog
			WATCHDOG_RESET;
				
			// Good engines number
			iGoodEnginesIndex = 0xFF;
				
			// Check chip existance
			if (!CHIP_EXISTS(umx)) continue;
				
			// Report speed of this processor
			#if !defined(__LIVE_FREQ_DETECTION)
			
				// Report what we had detected before
				sprintf(szTemp,"PROCESSOR %d: %d engines @ %d MHz -- MAP: %04X\n", umx, ASIC_get_chip_processor_count(umx) ,GLOBAL_CHIP_FREQUENCY_INFO[umx], (__chip_existence_map[umx]));
				strcat(szInfoReq, szTemp);
			#else
			
				// Now detect a good engine
				for (umz = 0; umz < 16; umz++)
				{
					// Should we ignore engine zero?
					#if defined(DO_NOT_USE_ENGINE_ZERO)
						if (umz == 0) continue;
					#endif
				
					// Is this engine ok?
					if (!IS_PROCESSOR_OK(umx, umz)) continue;
				
					// Is it a good engine?
					iGoodEnginesIndex = umz;
					break;
				}
			
				// Did we find any good engines?
				if (iGoodEnginesIndex == 0xFF)
				{
					sprintf(szTemp,"PROCESSOR %d: NO GOOD ENGINES!\n", umx);
					strcat(szInfoReq, szTemp);
				}
				else
				{
					// We have a good engine, test it
					iDetectedFreq = 0;
					iDetectedFreq = ASIC_tune_chip_to_frequency(umx, iGoodEnginesIndex, TRUE);
					
					sprintf(szTemp,"PROCESSOR %d: %d engines @ %d MHz -- MAP: %04X\n", umx, 
							ASIC_get_chip_processor_count(umx), 
							(iDetectedFreq / 1000000), 
							(__chip_existence_map[umx]));
							
					strcat(szInfoReq, szTemp);
					iTheoreticalMaxSpeed += (ASIC_get_chip_processor_count(umx) * (iDetectedFreq / 1000000));
				}
				
			#endif 
		}
		
		sprintf(szTemp,"THEORETICAL MAX: %d MH/s\n", iTheoreticalMaxSpeed);
		strcat(szInfoReq, szTemp);
	
	#endif
	
	#if defined(__REPORT_BALANCING_SPREADS)
		for (char vChip = 0; vChip < TOTAL_CHIPS_INSTALLED; vChip++)
		{
			if (!CHIP_EXISTS(vChip)) continue;
			
			for (char vEngine = 0; vEngine < 16; vEngine++)
			{
				if (!IS_PROCESSOR_OK(vChip, vEngine)) continue;
				
				// Report
				sprintf(szTemp,"CHIP %d PROCESSOR %d: %08X to %08X, TOTAL: %d\n", 
						vChip, vEngine, GLOBAL_CHIP_PROCESSOR_ENGINE_LOWBOUND[vChip][vEngine], 
						GLOBAL_CHIP_PROCESSOR_ENGINE_HIGHBOUND[vChip][vEngine], 
						GLOBAL_CHIP_PROCESSOR_ENGINE_HIGHBOUND[vChip][vEngine] - GLOBAL_CHIP_PROCESSOR_ENGINE_LOWBOUND[vChip][vEngine]);
				strcat(szInfoReq, szTemp);				
			}
		}
			
	#endif
	
	#if defined(__CHIP_DIAGNOSTICS_VERBOSE)
		// Turn LED OFF
		MCU_MainLED_Reset();
				
		// Working...
		  char bFailedEngine = FALSE;
		
		// Now run chip-by-chip diagnostics
		#if defined(__CHIP_BY_CHIP_DIAGNOSTICS)
		
					
