futurehome/stm32bfg/AVR/HostInteractionProtocols.c
			unsigned char umx = 0;
			for (umx = 0; umx < TOTAL_CHIPS_INSTALLED; umx++)
			{
				if (!CHIP_EXISTS(umx)) continue;

				// Show spreads?
				#if defined(__EXPORT_ENGINE_RANGE_SPREADS)
					sprintf(szTemp,"[CHIP %d] Spreads: %08X-%08X, %08X-%08X, %08X-%08X, %08X-%08X\n", umx, __ENGINE_LOWRANGE_SPREADS[umx][0], __ENGINE_HIGHRANGE_SPREADS[umx][0], __ENGINE_LOWRANGE_SPREADS[umx][1], __ENGINE_HIGHRANGE_SPREADS[umx][1], __ENGINE_LOWRANGE_SPREADS[umx][2], __ENGINE_HIGHRANGE_SPREADS[umx][2], __ENGINE_LOWRANGE_SPREADS[umx][3], __ENGINE_HIGHRANGE_SPREADS[umx][3]);
					strcat(szInfoReq, szTemp);
					sprintf(szTemp,"[CHIP %d] Spreads: %08X-%08X, %08X-%08X, %08X-%08X, %08X-%08X\n", umx, __ENGINE_LOWRANGE_SPREADS[umx][4], __ENGINE_HIGHRANGE_SPREADS[umx][4], __ENGINE_LOWRANGE_SPREADS[umx][5], __ENGINE_HIGHRANGE_SPREADS[umx][5], __ENGINE_LOWRANGE_SPREADS[umx][6], __ENGINE_HIGHRANGE_SPREADS[umx][6], __ENGINE_LOWRANGE_SPREADS[umx][7], __ENGINE_HIGHRANGE_SPREADS[umx][7]);
					strcat(szInfoReq, szTemp);
					sprintf(szTemp,"[CHIP %d] Spreads: %08X-%08X, %08X-%08X, %08X-%08X, %08X-%08X\n", umx, __ENGINE_LOWRANGE_SPREADS[umx][8], __ENGINE_HIGHRANGE_SPREADS[umx][8], __ENGINE_LOWRANGE_SPREADS[umx][9], __ENGINE_HIGHRANGE_SPREADS[umx][9], __ENGINE_LOWRANGE_SPREADS[umx][10], __ENGINE_HIGHRANGE_SPREADS[umx][10], __ENGINE_LOWRANGE_SPREADS[umx][11], __ENGINE_HIGHRANGE_SPREADS[umx][11]);
					strcat(szInfoReq, szTemp);					
					sprintf(szTemp,"[CHIP %d] Spreads: %08X-%08X, %08X-%08X, %08X-%08X, %08X-%08X\n", umx, __ENGINE_LOWRANGE_SPREADS[umx][12], __ENGINE_HIGHRANGE_SPREADS[umx][12], __ENGINE_LOWRANGE_SPREADS[umx][13], __ENGINE_HIGHRANGE_SPREADS[umx][13], __ENGINE_LOWRANGE_SPREADS[umx][14], __ENGINE_HIGHRANGE_SPREADS[umx][14], __ENGINE_LOWRANGE_SPREADS[umx][15], __ENGINE_HIGHRANGE_SPREADS[umx][15]);
					strcat(szInfoReq, szTemp);				
				#endif
				
				// Announce
				sprintf(szTemp,"[CHIP %d] Entry:\n", umx);
				strcat(szInfoReq, szTemp);
											
				// Are we running diagnostics on the engines too?
				#if defined(__ENGINE_BY_ENGINE_DIAGNOSTICS)
					unsigned char i_engine = 0;
					for (i_engine = 0; i_engine < 16; i_engine++)
					{
						// Reset Watchdog
						WATCHDOG_RESET;						
						bFailedEngine = FALSE;
						
						// STATIC RULE - Engine 0 not used
						#if defined(DO_NOT_USE_ENGINE_ZERO)
							if (i_engine == 0) continue; // Do not start engine 0
						#endif
						
						// Is engine ok?
						if (!IS_PROCESSOR_OK(umx, i_engine)) continue;
												
						// OK Proceed...
						uL1 = MACRO_GetTickCountRet;
						job_packet jp;
						ASIC_ReadComplete(umx,i_engine);
						ASIC_job_issue_to_specified_engine(umx, i_engine, &jp, FALSE, TRUE, TRUE, 0x0, 0x10000);
						xL2 = MACRO_GetTickCountRet;
						while (TRUE)
						{
							 __MCU_ASIC_Activate_CS();			//((umx < 8) ? 1 : 2);
						     if (ASIC_has_engine_finished_processing(umx, i_engine) == TRUE) break;
							 __MCU_ASIC_Deactivate_CS();			//((umx < 8) ? 1 : 2);
							 
							 WATCHDOG_RESET;
							 if (MACRO_GetTickCountRet - xL2 > 250000)
							 {
								 bFailedEngine = TRUE;
								 break;
							 }
						}							 
						uL2 = MACRO_GetTickCountRet;
						uLRes = (u32)((u32)uL2 - (u32)uL1);
						if (bFailedEngine)
						{
							sprintf(szTemp,"\t[ENGINE %d] FAILED! us\n", i_engine, (unsigned int)uLRes);
							strcat(szInfoReq, szTemp);
						}						
						else
						{
							sprintf(szTemp,"\t[ENGINE %d] Single-job takes: %u us, Submission: %d\n", i_engine, (unsigned int)uLRes,(unsigned int)xL2 - uL1);
							strcat(szInfoReq, szTemp);							
						}
						
					}
				#endif

			}
			
		#endif
		
		// Turn it back on...
		MCU_MainLED_Set();
	#endif
	
	
	
	// Add Engine count
	sprintf(szTemp,"ENGINES: %d\n", ASIC_get_processor_count());
	strcat(szInfoReq, szTemp);
	
	// Add Engine freuqnecy
	sprintf(szTemp,"FREQUENCY: %d MHz\n", __ASIC_FREQUENCY_VALUES[__ASIC_FREQUENCY_ACTUAL_INDEX]);
	strcat(szInfoReq, szTemp);
		
	// Add Chain Status
	sprintf(szTemp,"XLINK MODE: %s\n", XLINK_ARE_WE_MASTER ? "MASTER" : "SLAVE" );
	strcat(szInfoReq, szTemp);
	
	// Critical Temperature
	sprintf(szTemp,"CRITICAL TEMPERATURE: %d\n", (GLOBAL_CRITICAL_TEMPERATURE == TRUE) ? 1 : 0);
	strcat(szInfoReq, szTemp);
		
	
	// Add XLINK chip installed status
	sprintf(szTemp,"XLINK PRESENT: %s\n", (XLINK_is_cpld_present() == TRUE) ? "YES" : "NO");
	strcat(szInfoReq, szTemp);	
	
	// If we are master, how many devices exist in chain?
	if ((XLINK_ARE_WE_MASTER == TRUE) && (XLINK_is_cpld_present() == TRUE))
	{
		// Show total devices
		sprintf(szTemp,"DEVICES IN CHAIN: %d\n", XLINK_MASTER_getChainLength() + 1); // +1 is the for master (meaning us!)
		strcat (szInfoReq, szTemp);
		
		// Show device bit-mask
		sprintf(szTemp,"CHAIN PRESENCE MASK: %08X\n", GLOBAL_XLINK_DEVICE_AVAILABILITY_BITMASK | 0x01); // Bit zero is always set, which is the master
		strcat (szInfoReq, szTemp);
		
	}
	
	// Add the terminator
	strcat(szInfoReq, "OK\n");

	// All is good... sent the identifier and get out of here...
	if (XLINK_ARE_WE_MASTER)
	{
		USB_send_string(szInfoReq);  // Send it to USB
	}		
	else // We're a slave... send it by XLINK
	{
		char bTimeoutDetected = 0;
		XLINK_SLAVE_respond_transact(szInfoReq, strlen(szInfoReq), __XLINK_TRANSACTION_TIMEOUT__, &bTimeoutDetected, FALSE);
	}
	
	// Return our result...
	return res;
}

PROTOCOL_RESULT Protocol_fan_set(char iValue)
{
			
	// Requests...		
	  char iRequestedMod; 
	  char szResponse[64];
	iRequestedMod = iValue - 48;	
	strcpy(szResponse,"");
		
	// We have linear request, it should be 0 to 5 and '9'
	if ((iRequestedMod > 0) && (iRequestedMod < 6))
	{	
		// Set the proper state
		// Note: iRequestedMod is now corresponds to FAN_STATE_<VALUE> modes, so we can used it directly
		FAN_SUBSYS_SetFanState(iRequestedMod);
	}	
	else if(iRequestedMod == 9)
	{	
		// Set the proper state
		// Note: iRequestedMod is now corresponds to FAN_STATE_<VALUE> modes, so we can used it directly
		FAN_SUBSYS_SetFanState(iRequestedMod);
	}
	else
	{
		// We have an error
		strcpy(szResponse, "ERR:INVALID FAN STATE\n");
	}
		
		
	// All is good... sent the identifier and get out of here...
	if (XLINK_ARE_WE_MASTER)
	{	
		USB_send_string(szResponse);  // Send it to USB
	}	
	else // We're a slave... send it by XLINK
	{	
		char bTimeoutDetected = 0;
		XLINK_SLAVE_respond_transact(szResponse, sizeof(szResponse), 
									 __XLINK_TRANSACTION_TIMEOUT__, 
									 &bTimeoutDetected, FALSE);
	}	
	
