futurehome/stm32bfg/AVR/HostInteractionProtocols.c
	// Calculate single turn-around time
	  u32 iSecondaryTickTemp;
	  u32 iActualTickTemp;
	  u32 iTotalGoodDelay;

	  char szFailures[12000];
	  char szFailTemp[128];

	  char iTotal3Error;
	  char iTotal5Error;
	  char iTotal50Error;
	  char iTotal7Error;
	  char iTotal4Error;
	  char iTotal51Error;
	  char iTotalUTError;
	  char iTotalXError;
	
	  char szKeep[4];
	
	//char bTimedOut;
	char szResponse[10];
	unsigned int iRespLen;
	//char iBC;
	//char iLP;
	//char iSendersAddress;

	unsigned int x;
		// Generate Report
	  char szTempex[128];

	strcpy(szTempMsg,"");
	strcpy(szReportResult,"");
	// Run for theoretical 7.5seconds
	//for (  unsigned int x = 0; x < 10; x++)
	//{
		//WATCHDOG_RESET;
		memcpy((void*)ChipMiningStatus[3].cMidstate, (void*)jp.midstate, SHA_MIDSTATE_SIZE);
		memcpy((void*)ChipMiningStatus[3].cBlockdata, (void*)jp.block_data, SHA_BLOCKDATA_SIZE);
		ChipMiningStatus[3].ChipState = MINING;
		ChipMiningStatus[3].cEngineDoneCount = 0;
		ChipMiningStatus[3].cNonceCount = 0;
		//ASIC_job_issue_to_specified_engine(0,4,&jp, 0, 0x0FFFFFFFF);
		ASIC_job_issue(3);
		//Test_Sequence_2(3,1);
		
		/*__MCU_ASIC_Activate_CS();
		
		LoadBarrierAdder(0,1);
		LoadLimitRegisters(0,1);
		LoadRegistersValues_H0(0,1);
		LoadRegistersValues_H1(0,1);
		LoadRegistersValues_W(0,1);
		LoadCounterBounds(0,1,0,0x0FFFFFFFF);
		ASIC_WriteComplete(0,1);
		
		__MCU_ASIC_Deactivate_CS();*/
		
		// Wait for it to be finished
		/*while (ASIC_is_processing() == TRUE)
		{
			WATCHDOG_RESET;
			
			// Blink
			if ((ilr_counter % 100000) == 0)
			{
				if (iCurrentLEDState != 0)
				{
					 MCU_MainLED_Set();
					 iCurrentLEDState = 0;
				}
				else
				{
					MCU_MainLED_Reset();
					iCurrentLEDState = 1;
				}				
			}
			
			ilr_counter++;
		}*/
	//}
	
	MCU_MainLED_Set();	
	
	//return PROTOCOL_SUCCESS; // We will not proceed with the code here
	
	///////////////////////////////////////////////////////////
	// CPLD TEST Write different values to CPLD and read back
	//////////////////////////////////////////////////////////
	
	  //iActualTickTick = MACRO_GetTickCountRet;
	
	//iTotalWrongReads = 0;
	//umi = 0;
	//burst_write[4] = {0,0,0,0};
	//burst_write[0] = 0;
	//burst_write[1] = 0;
	//burst_write[2] = 0;
	//burst_write[3] = 0;
	//burst_read[4]  = {0,0,0,0};
	//burst_read[0]  = 0;
	//burst_read[1]  = 0;
	//burst_read[2]  = 0;
	//burst_read[3]  = 0;
		
	// Total time taken
	  iTotalTimeTaken = 0;
	  iTempX = 0;
	
	// Calculate single turn-around time
	  iSecondaryTickTemp = 0;
	  iActualTickTemp = 0;
	  iTotalGoodDelay = 0;
	
	iTurnaroundTime = 0x0FFFFFFFF;
	
	  //char szFailures[12000];
	  //char szFailTemp[128];
	strcpy(szFailTemp,"");
	strcpy(szFailures,"");	
	
	  iTotal3Error = 0;
	 iTotal5Error = 0;
	  iTotal50Error = 0;
	  iTotal7Error = 0;
	  iTotal4Error = 0;
	  iTotal51Error = 0;
	  iTotalUTError = 0;
	  iTotalXError = 0;
	
	  //szKeep[4] = {0,0,0,0};
	szKeep[0] = 0;
	szKeep[1] = 0;
	szKeep[2] = 0;
	szKeep[3] = 0;
	
	// Now we send message to XLINK_GENERAL_DISPATCH_ADDRESS for an ECHO and count the successful iterations
	for (x = 0; x < 100000; x++)
	{
		// Reset WAtchdog
		WATCHDOG_RESET;
		
		// Clear input
		MACRO_XLINK_clear_RX;
		
		// Now we wait for response
		  bTimedOut = FALSE;
		  iRespLen = 0;
		  //szResponse[10] = {0,0,0,0,0,0,0,0,0,0};
		  szResponse[0] = 0;
		  szResponse[1] = 0;
		  szResponse[2] = 0;
		  szResponse[3] = 0;
		  szResponse[4] = 0;
		  szResponse[5] = 0;
		  szResponse[6] = 0;
		  szResponse[7] = 0;
		  szResponse[8] = 0;
		  szResponse[9] = 0;
		  
		  //iBC = 0;
		  //iLP = 0;
		  //iSendersAddress = 0;
		
		//szResponse[0] = 0; szResponse[1] = 0; szResponse[2] = 0; szResponse[3] = 0;
		//iRespLen = 0;	
		
		iActualTickTemp = MACRO_GetTickCountRet;
	
		// Send the command
		//MACRO_XLINK_send_packet(1, "ZAX", 3, TRUE, FALSE);
		//MACRO_XLINK_wait_packet(szResponse, iRespLen, 90, bTimedOut, iSendersAddress, iLP, iBC );
		XLINK_MASTER_transact(1,"ZRX", 3, szResponse, &iRespLen, 128, __XLINK_TRANSACTION_TIMEOUT__, &bDevNotResponded, &bTimedOut, TRUE);
	
		// Update turnaround time
		iSecondaryTickTemp = MACRO_GetTickCountRet;
			
		// Increase total time
		iTempX = (iSecondaryTickTemp - iActualTickTemp);
		iTotalTimeTaken += iTempX;
		
		if ((iRespLen == 4) &&
			(szResponse[0] == 'P') &&
			(szResponse[1] == 'R') &&
			(szResponse[2] == 'S') &&
			(szResponse[3] == 'N'))
		{	
		
			// Increase good count
			iTotalGoodDelay += (iTempX);
			
			//  Update turnaround time
			if (iSecondaryTickTemp - iActualTickTemp < iTurnaroundTime) 
			{
				if (iSecondaryTickTemp - iActualTickTemp > 1) iTurnaroundTime = iSecondaryTickTemp - iActualTickTemp;
			}				
						
			// Increase our success counter			
			iSuccessCounter++;
		}
		else
		{
			// Report
			if ((bTimedOut == 3) || (bTimedOut == 77))
				iTotal3Error++;
			else if ((bTimedOut == 5))
				iTotal5Error++;
			else if ((bTimedOut == 50))		
			{		
				iTotal50Error++;
				szKeep[0] = GLOBAL_InterProcChars[0];
				szKeep[1] = GLOBAL_InterProcChars[1];
				szKeep[2] = GLOBAL_InterProcChars[2];
				szKeep[3] = GLOBAL_InterProcChars[3];
			}				
			else if ((bTimedOut == 51))
				iTotal50Error++;				
			else if (bTimedOut == 7)
				iTotal7Error++;
			else if (bTimedOut > 0)
				iTotalUTError++;
			else
				iTotalXError++;
			
		}
	}


	strcpy(szReportResult,"");	
	/*for (int x = 0; x < 30; x++)
	{
		sprintf(szTempex,"%d,", iTransactionTimes[x]);
		strcat(szReportResult, szTempex);
		
	}*/	
	sprintf(szTempex, "\nTotal success: %d / %d\nTotal duration: %u us\nLeast transact: %u us, Total good delay: %u us\n"
			"3Err: %d, 4Err: %d, 5Err: %d, 50Err: %d, 51Err: %d, 7Err: %d, UTErr: %d, XErr: %d, KEEP: %02X%02X%02X%02X\n",
			iSuccessCounter, 100000, (unsigned int)iTotalTimeTaken, (unsigned int)iTurnaroundTime,(unsigned int)iTotalGoodDelay,
			iTotal3Error, iTotal4Error, iTotal5Error, iTotal50Error, iTotal51Error, iTotal7Error, iTotalUTError, iTotalXError,
			szKeep[0], szKeep[1], szKeep[2], szKeep[3]);


	/*sprintf(szTempex, "\nTotal success: %d / %d\nTotal duration: %u us\nLeast transact: %u us\n",
			iSuccessCounter, 100000, (unsigned int)iTotalTimeTaken, (unsigned int)iTurnaroundTime);
	*/
	strcat(szReportResult, szTempex);
	//strcat(szReportResult, szFailures);
	
	// Send the OK back first
	// All is good... sent the identifier and get out of here...
	if (XLINK_ARE_WE_MASTER)
	{
		USB_send_string(szReportResult);  // Send it to USB
	}
	else // We're a slave... send it by XLINK
	{
		// We do nothing here...
	}	
	
