futurehome/stm32bfg/AVR/HostInteractionProtocols.c
	/*
	
	int iDigestValues[8] = {0,0,0,0,0,0,0,0};
		
	u32 iTickVal = GetTickCount();
		
	SHA256_Digest(0x0FFEE2E3A, iDigestValues);
	
	u32 iResultTick = GetTickCount() - iTickVal;
	
	char szReportResult[128];
	
	sprintf(szReportResult, "SHA2 Took %lu microseconds to complete\n", iResultTick);
	
	if (XLINK_ARE_WE_MASTER)
	{
		USB_send_string(szReportResult);  // Send it to USB
	}
	else // We're a slave... send it by XLINK
	{
		// We do nothing here...
	}
	*/
	
	/*unsigned u32 iActualTick = GetTickCount();
	  unsigned int iRetVals[8] = {0,0,0,0,0,0,0,0};
	SHA256_Digest("iiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiiKK", 362, iRetVals);
	char szResponse[128];
	unsigned u32 iPostTick = GetTickCount();
	unsigned int iDiff = (iPostTick - iActualTick);
	
	sprintf(szResponse, "HASH RESULT: %08X-%08X-%08X-%08X-%08X-%08X-%08X-%08X\nOperation took: %d us",
			iRetVals[0], iRetVals[1], iRetVals[2], iRetVals[3], iRetVals[4], iRetVals[5], iRetVals[6], iRetVals[7], iDiff);
	if (XLINK_ARE_WE_MASTER)
	{ 
		USB_send_string(szResponse);  // Send it to USB
	}
	else // We're a slave... send it by XLINK
	{
		// We do nothing here...
	}

	*/
	
	// Return our result...
	return res;
}

// Initiate process for the next job from the buffer
// And returns previous popped job result
// Adding a global flag and split code					changed by JJ 
void Protocol_PIPE_BUF_PUSH(void)
{
	char bXTimeoutDetected;
	//unsigned char bXTimeoutDetected;
	//char bYTimeoutDetected;
	//char sz_buf_tag[1024];
	//char* sz_buf;
	//unsigned int i_read;
	//unsigned int i_timeout;
	//unsigned char bInvalidData;
	//pjob_packet p_job;
	// Our result
	//PROTOCOL_RESULT res = PROTOCOL_SUCCESS;
	
	// We've received the ZX command, can we take this job now?
	if (cNewJobFifoFullFlag() == TRUE)
	{
		//PipeKernel_Spin(); // Function is called before we return
		
		if (XLINK_ARE_WE_MASTER)
		{
			USB_send_string("ERR:QUEUE FULL\n");  // Send it to USB
		}			
		else // We're a slave... send it by XLINK
		{
			bXTimeoutDetected = 0;
			XLINK_SLAVE_respond_transact("ERR:QUEUE FULL\n",
									sizeof("ERR:QUEUE FULL\n"),
									__XLINK_TRANSACTION_TIMEOUT__,
									&bXTimeoutDetected,
									FALSE);
		}			
		

	}
	
	// Are we at high-temperature, waiting to cool down?
	if (GLOBAL_CRITICAL_TEMPERATURE == TRUE)
	{
		if (XLINK_ARE_WE_MASTER)
		{
			USB_send_string("ERR:HIGH TEMPERATURE RECOVERY\n");  // Send it to USB
		}			
		else // We're a slave... send it by XLINK
		{
			bXTimeoutDetected = 0;
			XLINK_SLAVE_respond_transact("ERR:HIGH TEMPERATURE RECOVERY\n",
										sizeof("ERR:HIGH TEMPERATURE RECOVERY\n"),
										__XLINK_TRANSACTION_TIMEOUT__,
										&bXTimeoutDetected,
										FALSE);
		}
		
	
	}

	UsbOutDataBelongs = PIPE_BUF_PUSH;
	// We can take the job (either we start processing or we put it in the buffer)
	// Send data to ASIC and wait for response...
	// Send OK first
	if (XLINK_ARE_WE_MASTER)
	{
		USB_send_string("OK\n");
	}		
	else
	{
		bXTimeoutDetected = 0;
		XLINK_SLAVE_respond_transact("OK\n", sizeof("OK\n"), __XLINK_TRANSACTION_TIMEOUT__, &bXTimeoutDetected, FALSE);
	}

	
	StartSoftTimer0(1000);			//set time out 10s
	

}

//because of original code using dead loop to receive usb out pipe data, it will cause other module
//time out. I have to split code,  use flag and add entrance in main loop
PROTOCOL_RESULT Protocol_PIPE_BUF_PUSH_PART2(void)
{
		char bXTimeoutDetected;
	//unsigned char bXTimeoutDetected;
	//char bYTimeoutDetected;
	char sz_buf_tag[64];
	char* sz_buf;
	unsigned int i_read;
	//unsigned int i_timeout;
	unsigned char bInvalidData;
	job_packet* pNewJob;
	// Our result
	PROTOCOL_RESULT res = PROTOCOL_SUCCESS;

	// Wait for job data (96 Bytes)
	  //char sz_buf_tag[1024];
	  sz_buf = sz_buf_tag;
	//unsigned int i_read;
	//i_timeout = 1000000000;
	bInvalidData = FALSE;
/*
	// This packet contains Mid-State, Merkel-Data and Nonce Begin/End
	if (XLINK_ARE_WE_MASTER)
	{
		USB_wait_stream(sz_buf, &i_read, 1024, &i_timeout, &bInvalidData);
	}		
	else
	{
		char bTimeoutDetectedX = FALSE;
		XLINK_SLAVE_wait_transact(sz_buf, &i_read, 1024, __XLINK_TRANSACTION_TIMEOUT__, &bTimeoutDetectedX, FALSE, FALSE);
		if (bTimeoutDetectedX == TRUE) return PROTOCOL_FAILED;
		
		// Advance pointer, as XLINK will intercept the first character which is not used here
		sz_buf++;
	}
*/
	// Timeout?
	//if (i_timeout < 2)
	if(SoftTimer0.cTimerAlarm)
	{

		if (XLINK_ARE_WE_MASTER)
			USB_send_string("ERR:TIMEOUT\n");  // Send it to USB
		else // We're a slave... send it by XLINK
		{
			bXTimeoutDetected = 0;
			XLINK_SLAVE_respond_transact("ERR:TIMEOUT\n",
										sizeof("ERR:TIMEOUT\n"),
										__XLINK_TRANSACTION_TIMEOUT__,
										&bXTimeoutDetected,
										FALSE);
		}
		SoftTimer0.cTimerAlarm = FALSE;
		UsbOutDataBelongs = FREE_DATA;		//because of timeout, we need to access new command
		return PROTOCOL_TIMEOUT;
	}
	i_read = __ARM_UsbGetData((u8*)sz_buf, 64) - 1;   //i_read is payload, exclude byte[0]
	bInvalidData = (sz_buf[0] == i_read)? FALSE : TRUE;
	
	// Check integrity
	if ((bInvalidData) || (i_read < sizeof(job_packet))) // Extra 16 bytes are preamble / postamble
	{
		sprintf(sz_buf, "ERR:INVALID DATA\n");
		
		
		if (XLINK_ARE_WE_MASTER)
		{
			USB_send_string(sz_buf);  // Send it to USB
		}			
		else // We're a slave... send it by XLINK
		{
			bXTimeoutDetected = 0;
			XLINK_SLAVE_respond_transact(sz_buf,
										strlen(sz_buf),
										__XLINK_TRANSACTION_TIMEOUT__,
										&bXTimeoutDetected,
										FALSE);
		}
		UsbOutDataBelongs = FREE_DATA;		
		return PROTOCOL_INVALID_USB_DATA;
	}
	sz_buf ++;
	// All is ok, send data to ASIC for processing, and respond with OK
	pNewJob = (job_packet*)(sz_buf); 
	
	// Check signature
	if (pNewJob->signature != 0xAA)
	{
		sprintf(sz_buf, "ERR:SIGNATURE\n");

		if (XLINK_ARE_WE_MASTER)
		{
			USB_send_string(sz_buf);  // Send it to USB
		}
		else // We're a slave... send it by XLINK
		{
			bXTimeoutDetected = 0;
			XLINK_SLAVE_respond_transact(sz_buf,
										 strlen(sz_buf),
										 __XLINK_TRANSACTION_TIMEOUT__,
										 &bXTimeoutDetected,
										 FALSE);
		}
		UsbOutDataBelongs = FREE_DATA;
		return PROTOCOL_INVALID_USB_DATA;		
	}
	
