futurehome/stm32bfg/AVR/HostInteractionProtocols.c
	// Job is ok, push it to stack
	//JobPipe__pipe_push_job(p_job);
	JobPipe_AddNewJob2Fifo(pNewJob);
	
	// SIGNATURE CHECK
	// Respond with 'ERR:SIGNATURE' if not matched

	// Before we return, we must call this function to get buffer loop going...
	//PipeKernel_Spin();

	// Job was pushed into buffer, let the host know
	if (XLINK_ARE_WE_MASTER)
	{
		USB_send_string("OK:QUEUED\n");  // Send it to USB
	}
	else // We're a slave... send it by XLINK
	{
		bXTimeoutDetected = 0;
		XLINK_SLAVE_respond_transact("OK:QUEUED\n",
									sizeof("OK:QUEUED"),
									__XLINK_TRANSACTION_TIMEOUT__,
									&bXTimeoutDetected,
									FALSE);
	}

	// Increase the number of BUF-P2P jobs ever received
	__total_buf_pipe_jobs_ever_received++;

	// Return our result
	ClearSoftTimer0();
	UsbOutDataBelongs = FREE_DATA;
	return res;
}


u16 wPipeBufferPushPackCount;

// Push a package of jobs, 5 to be exact
PROTOCOL_RESULT Protocol_PIPE_BUF_PUSH_PACK(void)
{
	char bXTimeoutDetected;
	char bYTimeoutDetected;

	// Our result
	PROTOCOL_RESULT res = PROTOCOL_SUCCESS;
	
	// Our small buffer
	  //char szBuffer64[64];
	  //char iTotalAccepted = 0;
	
	// We've received the ZX command, can we take this job now?
	if (JobPipe_GetNewJobFifoAvailableSpace() < 5)
	{
		if (XLINK_ARE_WE_MASTER)
		{
			USB_send_string("ERR:QUEUE FULL\n");  // Send it to USB
		}
		else // We're a slave... send it by XLINK
		{
			bXTimeoutDetected = 0;
			XLINK_SLAVE_respond_transact("ERR:QUEUE FULL\n",
										sizeof("ERR:QUEUE FULL\n"),
										__XLINK_TRANSACTION_TIMEOUT__,
										&bXTimeoutDetected,
										FALSE);
		}
		UsbOutDataBelongs = FREE_DATA;
		return PROTOCOL_FAILED;
	}
	
	// Are we at high-temperature, waiting to cool down?
	if (GLOBAL_CRITICAL_TEMPERATURE == TRUE)
	{
		if (XLINK_ARE_WE_MASTER)
		{
			USB_send_string("ERR:HIGH TEMPERATURE RECOVERY\n");  // Send it to USB	
		}		
		else // We're a slave... send it by XLINK
		{
			bXTimeoutDetected = 0;
			XLINK_SLAVE_respond_transact("ERR:HIGH TEMPERATURE RECOVERY\n",
										sizeof("ERR:HIGH TEMPERATURE RECOVERY\n"),
										__XLINK_TRANSACTION_TIMEOUT__,
										&bXTimeoutDetected,
										FALSE);
		}
		UsbOutDataBelongs = FREE_DATA;
		return PROTOCOL_FAILED;
	}

	wPipeBufferPushPackCount = 0;
	UsbOutDataBelongs = PIPE_BUF_PUSH_PACK;
	// We can take the job (either we start processing or we put it in the buffer)
	// Send data to ASIC and wait for response...
	// Send OK first
	if (XLINK_ARE_WE_MASTER)
	{
		USB_send_string("OK\n");
	}		
	else
	{
		bYTimeoutDetected = 0;
		XLINK_SLAVE_respond_transact("OK\n", sizeof("OK\n"), __XLINK_TRANSACTION_TIMEOUT__, &bYTimeoutDetected, FALSE);
	}
	

	StartSoftTimer0(1000);			//set time out 10s

	// Return our result
	return res;
}



PROTOCOL_RESULT Protocol_PIPE_BUF_PUSH_PACK_PART2(void)
{
	char bXTimeoutDetected;
	//char bYTimeoutDetected;
	char sz_buf_tag[512];
	char* sz_buf;
	unsigned int i_read;
	//unsigned int i_timeout;
	unsigned char bInvalidData;
	unsigned char iDetectedPayloadSize;
	//char bTimeoutDetectedX;
	unsigned char stream__payloadSize ;
	unsigned char stream__signature  ;
	unsigned char stream__jobsInArray ;
	unsigned char stream__endOfWrapper ;
	//pjob_packet pointer_to_jobs_0;
	//pjob_packet pointer_to_jobs_1;
	//pjob_packet pointer_to_jobs_2;
	//pjob_packet pointer_to_jobs_3;
	//pjob_packet pointer_to_jobs_4;
	//char total_space_available;
	//char total_jobs_to_take;
	char szBuffer64[64];
	u32 i;
	// Our result
	PROTOCOL_RESULT res = PROTOCOL_SUCCESS;


	// Wait for job data (96 Bytes)
	  //char sz_buf_tag[512];
	  sz_buf = sz_buf_tag;
	//unsigned int i_read;
	//i_timeout = 1000000000;
	bInvalidData = FALSE;
	iDetectedPayloadSize = 0;

	/*
	// This packet contains Mid-State, Merkel-Data and Nonce Begin/End
	if (XLINK_ARE_WE_MASTER)
	{
		USB_wait_stream(sz_buf, &i_read, 1024, &i_timeout, &bInvalidData);
		iDetectedPayloadSize = (unsigned char)i_read;
	}		
	else
	{
		bTimeoutDetectedX = FALSE;
		XLINK_SLAVE_wait_transact(sz_buf, &i_read, 512, __XLINK_TRANSACTION_TIMEOUT__, &bTimeoutDetectedX, FALSE, FALSE);
		
		if (bTimeoutDetectedX == TRUE)
		{
			 return PROTOCOL_FAILED;
		}			 
		
		// Increment sz_buf since header byte does exist in XLINK and we don't need it
		iDetectedPayloadSize = sz_buf[0];
		i_read = i_read - 1; // Since XLINK does transfer the Payload Length to us, which is not considered as data in our case. Thus we have to ignore it.
		sz_buf = sz_buf + 1;
	}*/
	

	// Timeout?
	if(SoftTimer0.cTimerAlarm)
	{
		if (XLINK_ARE_WE_MASTER)
		{
			USB_send_string("ERR:TIMEOUT\n");  // Send it to USB	
		}		
		else // We're a slave... send it by XLINK
		{
			bXTimeoutDetected = 0;
			XLINK_SLAVE_respond_transact("ERR:TIMEOUT\n",
										sizeof("ERR:TIMEOUT\n"),
										__XLINK_TRANSACTION_TIMEOUT__,
										&bXTimeoutDetected,
										FALSE);
		}
		SoftTimer0.cTimerAlarm = FALSE;
		UsbOutDataBelongs = FREE_DATA;
		return PROTOCOL_TIMEOUT;
	}

	iDetectedPayloadSize = *(u8*)(cUsbReceiveLoopBuffer + wReceiveLoopBufferStart);		//1st byte in pack is payload size
	i_read = GetUsbRxBufferDataLength();
	if(iDetectedPayloadSize >= i_read)		//because of FS USB only out 64B per transfer, so pending rest data
	{
		return PROTOCOL_OUT_PIPE_PENDING;
	}

	
	// THIS IS THE STRUCTURE OF THE JOB PACK
	// --------------------------------------
	// unsigned __int8 payloadSize; // NOT SEEN IN OUR RESULT
	// unsigned __int8 signature;   == 0x0C1
	// unsigned __int8 jobsInArray;
	// job_packets[<jobsInArray>];
	// unsigned __int8 endOfWrapper == 0x0FE
	// --------------------------------------	
	
	// Received length should not be greater than 255. Check for it...

	i_read --;	
	if (i_read > 255)
	{
		// Some fault
		sprintf(sz_buf, "ERR:INVALID DATA\n");

		if (XLINK_ARE_WE_MASTER)
		{
			USB_send_string(sz_buf);  // Send it to USB
		}
		else // We're a slave... send it by XLINK
		{
			bXTimeoutDetected = 0;
			XLINK_SLAVE_respond_transact(sz_buf,
										 strlen(sz_buf),
										 __XLINK_TRANSACTION_TIMEOUT__,
										 &bXTimeoutDetected,
										 FALSE);
		}
		ClearSoftTimer0();
		UsbOutDataBelongs = FREE_DATA;
		return PROTOCOL_INVALID_USB_DATA;
	}

	i_read = __ARM_UsbGetData((u8*)sz_buf, 1024) - 1; 
	bInvalidData = (sz_buf[0] == i_read)? FALSE : TRUE;
	iDetectedPayloadSize = sz_buf[0];
	// Check integrity
	if ((bInvalidData) || (i_read < sizeof(job_packet) + 1 + 1 + 1 + 1)) // sizeof(job_packet) + payloadSize + signature + jobsInArray + endOfWrapper
	{
		sprintf(sz_buf, "ERR:INVALID DATA\n");
		
		if (XLINK_ARE_WE_MASTER)
		{
			USB_send_string(sz_buf);  // Send it to USB	
		}		
		else // We're a slave... send it by XLINK
		{
			bXTimeoutDetected = 0;
			XLINK_SLAVE_respond_transact(sz_buf,
										strlen(sz_buf),
										__XLINK_TRANSACTION_TIMEOUT__,
										&bXTimeoutDetected,
										FALSE);
		}
		ClearSoftTimer0();
		UsbOutDataBelongs = FREE_DATA;
		return PROTOCOL_INVALID_USB_DATA;
	}
	sz_buf ++;		//skip 1st byte, payload size
	// All is OK, send data to ASIC for processing, and respond with OK
	  stream__payloadSize  = iDetectedPayloadSize;
	  stream__signature    = sz_buf[0];
	  stream__jobsInArray  = sz_buf[1];
	  stream__endOfWrapper = sz_buf[i_read - 1];
		
	// SIGNATURE CHECK
	// Respond with 'ERR:SIGNATURE' if not matched
	if (//(stream__payloadSize  > 255+3)  ||			//seems error, char can not bigger than 255
		(stream__payloadSize  > 233)  ||		//changed by JJ
		(stream__signature    != 0x0C1) || // Initial Signature
		(stream__jobsInArray  > 5)		||
		(stream__jobsInArray  == 0)		|| // Terminating Signature
		(stream__endOfWrapper != 0x0FE))
	{
		if (XLINK_ARE_WE_MASTER)
		{
			USB_send_string("ERR:SIGNATURE\n");  // Send it to USB
		}
		else // We're a slave... send it by XLINK
		{
			bXTimeoutDetected = 0;
			XLINK_SLAVE_respond_transact("ERR:SIGNATURE\n",
										 sizeof("ERR:SIGNATURE\n"),
										 __XLINK_TRANSACTION_TIMEOUT__,
										 &bXTimeoutDetected,
										 FALSE);
		}
		UsbOutDataBelongs = FREE_DATA;
		return PROTOCOL_INVALID_USB_DATA;
	}

