futurehome/stm32bfg/AVR/HostInteractionProtocols.c
	for(i=0; i<stream__jobsInArray; i++)
	{
		 JobPipe_AddNewJob2Fifo((job_packet*)(sz_buf + 2 + (i *(sizeof(job_packet) + 1)) + 1));
	}
	/*
	// Now our famous JobPackets
	  pointer_to_jobs_0 = (pjob_packet)((void*)(sz_buf + 2 + (0*(sizeof(job_packet) + 1)) +1 ));
	  pointer_to_jobs_1 = (pjob_packet)((void*)(sz_buf + 2 + (1*(sizeof(job_packet) + 1)) +1 ));
	  pointer_to_jobs_2 = (pjob_packet)((void*)(sz_buf + 2 + (2*(sizeof(job_packet) + 1)) +1 ));
	  pointer_to_jobs_3 = (pjob_packet)((void*)(sz_buf + 2 + (3*(sizeof(job_packet) + 1)) +1 ));
	  pointer_to_jobs_4 = (pjob_packet)((void*)(sz_buf + 2 + (4*(sizeof(job_packet) + 1)) +1 )); // Last +1 is to skip the sigunature
	
	// Now check how many jobs we can take...
	  total_space_available = 5; //JobPipe__available_space();
	  total_jobs_to_take    = (total_space_available > stream__jobsInArray) ? stream__jobsInArray : total_space_available;
		
	// Push the job...
	if  (total_jobs_to_take >= 1) JobPipe_AddNewJob2Fifo((void*)(pointer_to_jobs_0));
	if ((total_jobs_to_take >= 2) && (stream__jobsInArray > 1)) JobPipe_AddNewJob2Fifo((void*)(pointer_to_jobs_1));
	if ((total_jobs_to_take >= 3) && (stream__jobsInArray > 2)) JobPipe_AddNewJob2Fifo((void*)(pointer_to_jobs_2));
	if ((total_jobs_to_take >= 4) && (stream__jobsInArray > 3)) JobPipe_AddNewJob2Fifo((void*)(pointer_to_jobs_3));
	if ((total_jobs_to_take == 5) && (stream__jobsInArray > 4)) JobPipe_AddNewJob2Fifo((void*)(pointer_to_jobs_4));
	*/
	// Job was pushed into buffer, let the host know
	// Generate the message
	sprintf(szBuffer64,"OK:QUEUED %d\n", stream__jobsInArray);
	
	if (XLINK_ARE_WE_MASTER)
	{
		USB_send_string(szBuffer64);  // Send it to USB	
	}	
	else // We're a slave... send it by XLINK
	{
		bXTimeoutDetected = 0;
		XLINK_SLAVE_respond_transact(szBuffer64,
									strlen(szBuffer64),
									__XLINK_TRANSACTION_TIMEOUT__,
									&bXTimeoutDetected,
									FALSE);
	}

	// Increase the number of BUF-P2P jobs ever received
	__total_buf_pipe_jobs_ever_received++;
	
	// Set Mark1
	//if (iMark1 == 0) iMark1 = MACRO_GetTickCountRet;

	ClearSoftTimer0();
	UsbOutDataBelongs = FREE_DATA;
	return res;
}


// ZQX
PROTOCOL_RESULT  Protocol_PIPE_BUF_FLUSH(void)
{
	char szFlshString[32];
	char bXTimeoutDetected;
	u8 iTotalJobsActuallyInBuffer;
	// Our result
	PROTOCOL_RESULT res = PROTOCOL_SUCCESS;

	// Reset the FIFO
	iTotalJobsActuallyInBuffer = JobPipe_GetJobResultCountInFifo()
									+ JobPipe_GetNewJobCountInFifo();		
	JobPipe__pipe_flush_buffer();
	
	// Send OK first

	sprintf(szFlshString, "OK:FLUSHED %02d\n", iTotalJobsActuallyInBuffer);
	
	if (XLINK_ARE_WE_MASTER)
	{
		USB_send_string(szFlshString);  // Send it to USB
	}		
	else // We're a slave... send it by XLINK
	{
		bXTimeoutDetected = 0;
		XLINK_SLAVE_respond_transact(szFlshString, strlen(szFlshString),
									__XLINK_TRANSACTION_TIMEOUT__,
									&bXTimeoutDetected,
									FALSE);
	}		

	// Return our result
	return res;
}

// ZqX
PROTOCOL_RESULT  Protocol_PIPE_BUF_FLUSH_EX(void)
{
	unsigned char iTotalJobsBeingProcessed;
	u8 cChip;
	char szFlshString[4096];
	unsigned int iActualTerminationIndex ;
	char bXTimeoutDetected;
	char iTotalJobsActuallyInBuffer;
	// Our result
	PROTOCOL_RESULT res = PROTOCOL_SUCCESS;

	// Reset the FIFO
	iTotalJobsActuallyInBuffer = JobPipe_GetJobResultCountInFifo()
									+ JobPipe_GetNewJobCountInFifo();   
	JobPipe__pipe_flush_buffer();

	// How many jobs being processed?
	iTotalJobsBeingProcessed = 0;
	for (cChip = 0; cChip < TOTAL_CHIPS_INSTALLED; cChip++)
	{
		// Add it to stream
		if (!CHIP_EXISTS(cChip)) continue;
		if (ChipMiningStatus[cChip].ChipState == MINING) iTotalJobsBeingProcessed++;
	}	

	// Send OK first
	
	sprintf(szFlshString, "COUNT:%d FLUSHED:%d\n", iTotalJobsBeingProcessed, iTotalJobsActuallyInBuffer);

	// Also add the remaining information
	iActualTerminationIndex = strlen(szFlshString);
	for (cChip = 0; cChip < TOTAL_CHIPS_INSTALLED; cChip++)
	{
		// Add it to stream
		if (!CHIP_EXISTS(cChip)) continue;
		if (ChipMiningStatus[cChip].ChipState == IDLE) continue;
		__aux_PrintFlushResultToBuffer(szFlshString, cChip, iActualTerminationIndex, &iActualTerminationIndex);				
	}
	
	strcat(szFlshString,"OK\n");
	
	// Proceed...
	if (XLINK_ARE_WE_MASTER)
	{
		USB_send_string(szFlshString);  // Send it to USB
	}
	else // We're a slave... send it by XLINK
	{
		bXTimeoutDetected = 0;
		XLINK_SLAVE_respond_transact(szFlshString, strlen(szFlshString),
									__XLINK_TRANSACTION_TIMEOUT__,
									&bXTimeoutDetected,
									FALSE);
	}

	// Return our result
	return res;
}


// Returns only the status of the last processed job
// from the buffer, and will not initiate the next job process
PROTOCOL_RESULT	Protocol_PIPE_BUF_STATUS(void)
{
	// Our result
	PROTOCOL_RESULT res = PROTOCOL_SUCCESS;

	// We can take the job (either we start processing or we put it in the buffer)
	char sz_rep[3500];
	char sz_temp[256];
	//char sz_temp2[256];
	//char sz_temp3[32];
	//unsigned int istream_len;
	char i_cnt;

	// Should we do an engine start at the end of the function?
	//char i_engine_start_req = 0;
	unsigned int iActualTerminationIndex;
	//int iStrLen;
	char bXTimeoutDetected;

	// How many jobs can we take in?
	
	/*sprintf(sz_temp, "STORAGE:%d\n", PIPE_MAX_BUFFER_DEPTH-__total_jobs_in_buffer);
	strcat(sz_rep, sz_temp);*/

	// What is the actual
	// Are we processing something?
	//unsigned int  found_nonce_list[8];
	//char found_nonce_count;
	
	// How many jobs to take? The smallest between 15 and "total results in buffer"
	unsigned int iTotalResultsToTake = 0;
	//unsigned char bHaveMoreResultsForNextTransaction = FALSE;
	strcpy(sz_rep,"");
	/*		need fix later
	if (JobPipe__pipe_get_buf_job_results_count() <= MAX_RESULTS_TO_SEND_AT_A_TIME_FROM_BUFFER)
	{
		iTotalResultsToTake = JobPipe__pipe_get_buf_job_results_count();
	}
	else
	{
		iTotalResultsToTake = MAX_RESULTS_TO_SEND_AT_A_TIME_FROM_BUFFER;
		bHaveMoreResultsForNextTransaction = TRUE;
	}*/

	// How many results?
	//sprintf(sz_temp,"INPROCESS:%d\n", ((PipeKernel_WasPreviousJobFromPipe() == TRUE) || (bHaveMoreResultsForNextTransaction == TRUE)) ? 1 : 0);
	//need fix later
	strcat(sz_rep, sz_temp);
		
	//sprintf(sz_temp,"COUNT:%d\n", JobPipe__pipe_get_buf_job_results_count());
	sprintf(sz_temp,"COUNT:%d\n", iTotalResultsToTake);	
	strcat(sz_rep, sz_temp);

	// What is our last index?
	iActualTerminationIndex = strlen(sz_rep);

