futurehome/stm32bfg/AVR/HostInteractionProtocols.c
	GLOBAL_BufResultToUSBLatency = MACRO_GetTickCountRet;
	GLOBAL_ResBufferCompilationLatency = MACRO_GetTickCountRet;
	
	
	// Ok, return the last result as well
	if (iActualTerminationIndex)   //need fix later   (JobPipe__pipe_get_buf_job_results_count() == 0)
	{
		// We simply do nothing... Just add the <LF> to the end of the line
	}
	else
	{
		// Now post them one by one
		for (i_cnt = 0; i_cnt < iTotalResultsToTake; i_cnt++)
		{
			// Get our job
			//pbuf_job_result_packet pjob_res = (pbuf_job_result_packet)(JobPipe__pipe_get_buf_job_result(i_cnt));
			
			// Add it to stream
			//__aux_PrintResultToBuffer(sz_rep, pjob_res, iActualTerminationIndex, &iActualTerminationIndex);
			
			// Also say which midstate and nonce-range is in process
			/*
			stream_to_hex(pjob_res->midstate , sz_temp2, 32, &istream_len);
			sz_temp2[istream_len] = 0;
			stream_to_hex(pjob_res->block_data, sz_temp3, 12, &istream_len);
			sz_temp3[istream_len] = 0;		
			
			// Add nonce-count...
			  unsigned char iNonceCount = pjob_res->i_nonce_count;
			
			#if defined(QUEUE_OPERATE_ONE_JOB_PER_CHIP)
				//sprintf(sz_temp,"%s,%s,%X,%d", sz_temp2, sz_temp3, pjob_res->iProcessingChip, iNonceCount); // Add midstate, block-data, count and nonces...
				//strcat(sz_rep, sz_temp);
				sprintf(sz_temp,"%s,%s,%d", sz_temp2, sz_temp3, iNonceCount); // Add midstate, block-data, count and nonces...
				strcat(sz_rep, sz_temp);				
			#else
				sprintf(sz_temp,"%s,%s,%d", sz_temp2, sz_temp3, iNonceCount); // Add midstate, block-data, count and nonces...
				strcat(sz_rep, sz_temp);			
			#endif
			
			// If there are nonces, add a comma here
			if (iNonceCount > 0)
			{
				 strcat(sz_rep,",");
			}				 
					
			// Nonces found...
			if ( pjob_res->i_nonce_count > 0)
			{
				// Our loop counter
				unsigned char ix = 0;
				
				for (ix = 0; ix < pjob_res->i_nonce_count; ix++)
				{
					sprintf(sz_temp2, "%08X", pjob_res->nonce_list[ix]);
					strcat(sz_rep, sz_temp2);

					// Add a comma if it's not the last nonce
					if (ix != pjob_res->i_nonce_count - 1) strcat(sz_rep,",");
				}

				// Add the 'Enter' character
				strcat(sz_temp, "\n");
			}

			// In the end, add the <LF>
			strcat(sz_rep,"\n");
			*/
		}
	}

	// Add the OK to our response (finilizer)
	strcat(sz_rep, "OK\n");
	
	//iStrLen = 0;
	//iStrLen = strlen(sz_rep);
	
	// Set compilation latency
	GLOBAL_ResBufferCompilationLatency = MACRO_GetTickCountRet - GLOBAL_ResBufferCompilationLatency;

	// Send OK first
	if (XLINK_ARE_WE_MASTER)
	{
		GLOBAL_USBToHostLatency = MACRO_GetTickCountRet;
		USB_send_string(sz_rep);  // Send it to USB
		GLOBAL_USBToHostLatency = MACRO_GetTickCountRet - GLOBAL_USBToHostLatency;
	}		
	else // We're a slave... send it by XLINK
	{
		bXTimeoutDetected = 0;
		XLINK_SLAVE_respond_transact(sz_rep,
									 strlen(sz_rep),
									 __XLINK_TRANSACTION_TIMEOUT__,
									 &bXTimeoutDetected,
									 FALSE);
	}		

	// Also, we clear the results buffer
	//JobPipe__pipe_skip_buf_job_results(iTotalResultsToTake);
	
	// Also say how long it has taken
	GLOBAL_BufResultToUSBLatency = MACRO_GetTickCountRet - GLOBAL_BufResultToUSBLatency;
	
	// Also Flush jobs into engines
	// PipeKernel_Spin();
	
	// Return the result...
	return res;
}

// Accelerate buffer compilation 

//#define _AUX_LEFT_HEX(x)   (__aux_CharMap[((x & 0xF0) >> 4)]) 
//#define _AUX_RIGHT_HEX(x)  (__aux_CharMap[(x & 0x0F)]) 

  void __aux_PrintResultToBuffer(char* szBuffer, const void* pResult, const unsigned int iStartPosition, unsigned int* iEndPositionPlusOne)
{
	char szNonceHolder[8];
	char iNonceCounter;
	// We have the job result
	  pbuf_job_result_packet pjob_res = (pbuf_job_result_packet)(pResult);
	
	// Ok, we start by outputting the midstate, starting from position 
	  unsigned int iHoverPos = iStartPosition;
	  unsigned int iTemp = 0;
	
	for (iTemp = 0; iTemp < 32; iTemp++)
	{
		szBuffer[iHoverPos]   = _AUX_LEFT_HEX(pjob_res->midstate[iTemp]);
		szBuffer[iHoverPos+1] = _AUX_RIGHT_HEX(pjob_res->midstate[iTemp]);
		
		// Increase iHover by 2
		iHoverPos += 2;
	}			

	// Add comma
	szBuffer[iHoverPos++] = ',';
	
	// Proceed	
	for (iTemp = 0; iTemp < 12; iTemp++)
	{
		szBuffer[iHoverPos]   = _AUX_LEFT_HEX (pjob_res->block_data[iTemp]);
		szBuffer[iHoverPos+1] = _AUX_RIGHT_HEX(pjob_res->block_data[iTemp]);
		
		// Increase iHover by 2
		iHoverPos += 2;
	}
	
	// Add chip number if running one job per chip
	#if defined(QUEUE_OPERATE_ONE_JOB_PER_CHIP)
	
		// Add comma
		szBuffer[iHoverPos++] = ',';
	
		// Count of the nonces?
		szBuffer[iHoverPos++] = __aux_CharMap[pjob_res->iProcessingChip];
		
	#endif
	
	// Add comma
	szBuffer[iHoverPos++] = ',';
	
	// Count of the nonces?
	szBuffer[iHoverPos++] = __aux_CharMap[pjob_res->i_nonce_count];
	
	// Nonce Holder

	
	// Ok, do we put '\n' or do we have nonces?
	if (pjob_res->i_nonce_count > 0)
	{
		// We proceed with nonces
		szBuffer[iHoverPos++] = ',';
		
		// Ok, for each nonce, we print
		for (iNonceCounter = 0; iNonceCounter < pjob_res->i_nonce_count; iNonceCounter++)
		{
			// Each nonce is 8 characters, so we put them manualy to speed things up
			sprintf(szNonceHolder,"%08X", pjob_res->nonce_list[iNonceCounter]);
			szBuffer[iHoverPos + 0] = szNonceHolder[0];
			szBuffer[iHoverPos + 1] = szNonceHolder[1];
			szBuffer[iHoverPos + 2] = szNonceHolder[2];
			szBuffer[iHoverPos + 3] = szNonceHolder[3];
			szBuffer[iHoverPos + 4] = szNonceHolder[4];
			szBuffer[iHoverPos + 5] = szNonceHolder[5];
			szBuffer[iHoverPos + 6] = szNonceHolder[6];
			szBuffer[iHoverPos + 7] = szNonceHolder[7];
			szBuffer[iHoverPos + 8] = (iNonceCounter == pjob_res->i_nonce_count - 1) ? ('\n') : (',');
			iHoverPos += 9;
		}
		
		// Now we return
		szBuffer[iHoverPos] = '\0'; // Terminate the string
		*iEndPositionPlusOne = iHoverPos;
	}
	else
	{
		szBuffer[iHoverPos++] = '\n';
		szBuffer[iHoverPos] = '\0';
		*iEndPositionPlusOne = iHoverPos;
		return;
	}
	
}

  void __aux_PrintFlushResultToBuffer(char* szBuffer, const int iChipIndex, const unsigned int iStartPosition, unsigned int* iEndPositionPlusOne)
{
	// Ok, we start by outputting the midstate, starting from position
	  unsigned int iHoverPos;
	  unsigned int iTemp = 0;


