futurehome/stm32bfg/AVR/HostInteractionProtocols.c
	iHoverPos = iStartPosition;
	for (iTemp = 0; iTemp < 32; iTemp++)
	{
		szBuffer[iHoverPos]   = _AUX_LEFT_HEX(ChipMiningStatus[iChipIndex].cMidstate[iTemp]);
		szBuffer[iHoverPos+1] = _AUX_RIGHT_HEX(ChipMiningStatus[iChipIndex].cMidstate[iTemp]);
		// Increase iHover by 2
		iHoverPos += 2;
	}

	// Add comma
	szBuffer[iHoverPos++] = ',';
	
	// Proceed
	for (iTemp = 0; iTemp < 12; iTemp++)
	{
		szBuffer[iHoverPos]   = _AUX_LEFT_HEX (ChipMiningStatus[iChipIndex].cBlockdata[iTemp]);
		szBuffer[iHoverPos+1] = _AUX_RIGHT_HEX(ChipMiningStatus[iChipIndex].cBlockdata[iTemp]);
		// Increase iHover by 2
		iHoverPos += 2;
	}
	
	// Add chip number if running one job per chip
	#if defined(QUEUE_OPERATE_ONE_JOB_PER_CHIP)
		// Add comma
		szBuffer[iHoverPos++] = ',';
		// Count of the nonces?
		szBuffer[iHoverPos++] = __aux_CharMap[iChipIndex];
	#endif
	
	// Count of the nonces?
	szBuffer[iHoverPos++] = '\n';
	szBuffer[iHoverPos] = '\0';
	*iEndPositionPlusOne = iHoverPos;
	return;
}




PROTOCOL_RESULT Protocol_handle_job(void)
{
	char bXTimeoutDetected;
	char sz_buf_tag[1024];
	char* sz_buf;
	unsigned int i_read;
	unsigned int i_timeout;
	unsigned char bInvalidData;
	char bTimeoutDetectedOnXLINK;
	pjob_packet p_job;
	// Our result
	PROTOCOL_RESULT res = PROTOCOL_SUCCESS;

	// Send data to ASIC and wait for response...
	// BTW, our actual timeout is 16 seconds... (1GH/s)
	// Also, we do expect a packet which is 64 Bytes data, 16 Bytes Midstate, 16 Bytes difficulty (totaling 96 Bytes)
	
	// Are we at high-temperature, waiting to cool down?
	if (GLOBAL_CRITICAL_TEMPERATURE == TRUE)
	{
		if (XLINK_ARE_WE_MASTER)
		{
			USB_send_string("ERR:HIGH TEMPERATURE RECOVERY\n");  // Send it to USB	
		}		
		else // We're a slave... send it by XLINK
		{
			bXTimeoutDetected = 0;
			XLINK_SLAVE_respond_transact("ERR:HIGH TEMPERATURE RECOVERY\n",
										 sizeof("ERR:HIGH TEMPERATURE RECOVERY\n"),
										 __XLINK_TRANSACTION_TIMEOUT__,
										 &bXTimeoutDetected,
										 FALSE);
		}
			
		return PROTOCOL_FAILED;
	}


	// Send OK first
	if (XLINK_ARE_WE_MASTER)
	{
		USB_send_string("OK\n");  // Send it to USB
	}		
	else // We're a slave... send it by XLINK
	{
		XLINK_SLAVE_respond_string("OK\n");	
	}		

	// Wait for job data (96 Bytes)
	  //char sz_buf_tag[1024];
	  sz_buf = sz_buf_tag;
	//unsigned int i_read;
	i_timeout = 1000000000;
	bInvalidData = FALSE;

	if (XLINK_ARE_WE_MASTER)
	{
	    USB_wait_stream(sz_buf, &i_read, 1024, &i_timeout, &bInvalidData);
	}		
	else
	{
		// Wait for incoming transactions
		bTimeoutDetectedOnXLINK = 0;
		XLINK_SLAVE_wait_transact(sz_buf, &i_read, 256, 100, &bTimeoutDetectedOnXLINK, FALSE, FALSE);
					
		// Check
		if (bTimeoutDetectedOnXLINK) return PROTOCOL_FAILED;	
		
		// Since XLINK will save the first character received, we have to advance the pointer
		sz_buf++;
	}

	// Timeout?
	if (i_timeout < 2)
	{
		if (XLINK_ARE_WE_MASTER)
		{
			USB_send_string("ERR:TIMEOUT\n");  // Send it to USB
		}			
		else // We're a slave... send it by XLINK
		{
			XLINK_SLAVE_respond_string("ERR:TIMEOUT\n");	
		}
				
		return PROTOCOL_TIMEOUT;
	}

	// Check integrity
	if ((bInvalidData) || (i_read < sizeof(job_packet))) // Extra 16 bytes are preamble / postamble 
														   // We write i_read because the byte-header is trimmed out when length is returned by the function
	{
		sprintf(sz_buf, "ERR:INVALID DATA\n");
		
		if (XLINK_ARE_WE_MASTER)
		{
			USB_send_string(sz_buf);  // Send it to USB
		}			
		else // We're a slave... send it by XLINK
		{
			XLINK_SLAVE_respond_string(sz_buf);
		}
								
		return PROTOCOL_INVALID_USB_DATA;
	}

	// All is ok, send data to ASIC for processing, and respond with OK
	p_job = (pjob_packet)(sz_buf);
	
	// Check signature
	if (p_job->signature != 0xAA)
	{
		if (XLINK_ARE_WE_MASTER)
		{
			USB_send_string("ERR:SIGNATURE<\n");  // Send it to USB
		}		
		else // We're a slave... send it by XLINK
		{
			XLINK_SLAVE_respond_string("ERR:SIGNATURE<\n");	
		}
		return PROTOCOL_FAILED;
	}

	// We have all what we need, send it to ASIC-COMM interface
	//ASIC_job_issue(p_job, 0, 0x0FFFFFFFF, FALSE, 0, FALSE);
	//need fix later

	// Send our OK
	if (XLINK_ARE_WE_MASTER)
	{
		USB_send_string("OK\n");  // Send it to USB
	}		
	else // We're a slave... send it by XLINK
	{
		XLINK_SLAVE_respond_string("OK\n");	
	}
	
	// Return our result...
	return res;
}

PROTOCOL_RESULT Protocol_handle_job_single_stage(char* szStream)
{
	char bXTimeoutDetected;
	char* sz_buf;
	pjob_packet p_job;
	// Our result
	PROTOCOL_RESULT res = PROTOCOL_SUCCESS;

	// Send data to ASIC and wait for response...
	// BTW, our actual timeout is 16 seconds... (1GH/s)
	// Also, we do expect a packet which is 64 Bytes data, 16 Bytes Midstate, 16 Bytes difficulty (totaling 96 Bytes)
	
	// Are we at high-temperature, waiting to cool down?
	if (GLOBAL_CRITICAL_TEMPERATURE == TRUE)
	{
		if (XLINK_ARE_WE_MASTER)
		{
			USB_send_string("ERR:HIGH TEMPERATURE RECOVERY\n");  // Send it to USB
		}
		else // We're a slave... send it by XLINK
		{
			bXTimeoutDetected = 0;
			XLINK_SLAVE_respond_transact("ERR:HIGH TEMPERATURE RECOVERY\n",
										sizeof("ERR:HIGH TEMPERATURE RECOVERY\n"),
										__XLINK_TRANSACTION_TIMEOUT__,
										&bXTimeoutDetected,
										FALSE);
		}
		
		return PROTOCOL_FAILED;
	}

	// Since XLINK will save the first character received, we have to advance the pointer
	sz_buf = (szStream + 3); // We should have the job here...
	
	// All is ok, send data to ASIC for processing, and respond with OK
	p_job = (pjob_packet)(sz_buf);
	
	// Check signature
	if (p_job->signature != 0xAA)
	{
		if (XLINK_ARE_WE_MASTER)
		{
			USB_send_string("ERR:SIGNATURE<\n");  // Send it to USB
		}
		else // We're a slave... send it by XLINK
		{
			XLINK_SLAVE_respond_string("ERR:SIGNATURE<\n");
		}
		return PROTOCOL_FAILED;
	}

	// We have all what we need, send it to ASIC-COMM interface
	//ASIC_job_issue(p_job, 0, 0x0FFFFFFFF, FALSE, 0, FALSE);
	//need fix later
	// Send our OK
	if (XLINK_ARE_WE_MASTER)
	{
		USB_send_string("OK\n");  // Send it to USB
	}
	else // We're a slave... send it by XLINK
	{
		XLINK_SLAVE_respond_string("OK\n");
	}
	
